system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;
solver          incompressibleFluid;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         0.3;

deltaT          1e-4;

adjustTimeStep  yes;
maxCo           5.0;

writeControl    adjustableRunTime;  // <--- ¡EL CULPABLE CORREGIDO!
writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
    forces
    {
        type            forceCoeffs;
        libs            ( "libforces.so" );
        writeControl    timeStep;
        writeInterval   1;
        patches         ( "perfil" );
        rho             rhoInf;
        rhoInf          1;
        liftDir         (-0.207912 0.978148 0);
        dragDir         (0.978148 0.207912 0);
        pitchAxis       ( 0 0 1 );
        magUInf         50.0;
        lRef            0.61;
        Aref            0.0305;
        CofR            ( 0.1525 0 0 );
    }
}

// ************************************************************************* //
