system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  13                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom patch;
sourceCase    ".";

// CAMBIO CRÍTICO: Plural y entre paréntesis para la Versión 13
sourcePatches (frontAndBack); 

flipNormals   false;

extrudeModel  linearDirection;

linearDirectionCoeffs
{
    direction       (0 0 1);
    thickness       0.05;
    nLayers         1;
    expansionRatio  1.0;
}

mergeFaces false;

